### Total: 7 = COMPLETE - all international events where medalist competed


2016
- 5

2020
- 2

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('bb_w.csv')

In [3]:
df[df['year']==2021]

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round
1539,1.0,Mélanie De Jesus Dos Santos,FRA,6.0,7.900,0.0,13.900,2021,final
1540,2.0,Sanne Wevers,NED,5.6,8.266,0.0,13.866,2021,final
1541,3.0,Anastasiia Bachynska,UKR,5.6,7.733,0.0,13.333,2021,final
1542,4.0,Amelie Morgan,GBR,5.3,7.866,0.0,13.166,2021,final
1543,5.0,Martina Maggio,ITA,4.9,8.100,0.0,13.000,2021,final
...,...,...,...,...,...,...,...,...,...
1737,83.0,Greta Banishka,BUL,4.1,4.700,NaN,8.800,2021,qual
1738,84.0,Thea Nygaard,NOR,4.7,4.100,NaN,8.800,2021,qual
1739,85.0,Victoria Kajø,DEN,4.3,4.000,NaN,8.300,2021,qual
1740,86.0,Linda Tugarinova,LAT,3.7,4.533,NaN,8.233,2021,qual
1741,87.0,Marina Nekrasova,AZE,1.6,7.666,-6.5,2.766,2021,qual

In [4]:
# sanne wevers

# 2016
1. sanne wevers (NED) - 1 competition for bb
2. laurie hernandez (USA) - no competition for bb
3. simone biles (USA) - competitions 


# 2020
1. guan chenchen (CHN) - only competition is olympics
2. tang xijing (CHN) - only competition was wc in 2019 but iaa 2019 
3. simone biles (USA) - 1 competition b/w 2017-2020

In [5]:
df['Name'] = df['Name'].str.lower()

In [6]:
df12 = df[df['year'].isin([2011])].copy()
df16 = df[df['year'].isin([2013, 2014, 2015, 2016])].copy()
df20 = df[df['year'].isin([2017, 2018, 2019, 2020, 2021])].copy()
df24 = df[df['year'].isin([2022, 2023])].copy()

In [7]:
# Define a function to assign medal values based on the "Name" column
def assign_medal(name):
    name_lower = name.lower()
    if name_lower == 'sanne wevers':
        return 1
    elif name_lower == 'laurie hernandez':
        return 1
    elif name_lower == 'simone biles':
        return 1
    else:
        return 0

# Apply the function to create the "medal" column
df16['medal'] = df16['Name'].apply(assign_medal)

In [8]:
df16[df16['Name']=='simone biles']

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round,medal
36,1.0,simone biles,USA,6.5,8.750,0.0,15.250,2015,final,1
159,3.0,simone biles,USA,6.1,8.233,0.0,14.333,2013,final,1
165,1.0,simone biles,USA,6.4,8.700,0.0,15.100,2014,final,1
173,1.0,simone biles,USA,6.4,8.958,0.0,15.358,2015,final,1

In [9]:

df16[df16['Name']=='laurie hernandez']

Empty DataFrame
Columns: [Rank, Name, nation, D Score, E Score, Pen., Total, year, round, medal]
Index: []

In [10]:
df16[df16['Name']=='sanne wevers']

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round,medal
174,2.0,sanne wevers,NED,5.7,8.633,0.0,14.333,2015,final,1

In [11]:
df16['medal'].value_counts()

medal
0    94
1     5
Name: count, dtype: int64

In [12]:
# Define a function to assign medal values based on the "Name" column
def assign_medal(name):
    name_lower = name.lower()
    if name_lower == 'guan chenchen':
        return 1
    elif name_lower == 'tang xijing ':
        return 1
    elif name_lower == 'simone biles':
        return 1
    else:
        return 0

# Apply the function to create the "medal" column
df20['medal'] = df20['Name'].apply(assign_medal)

In [13]:
df20[df20['Name']=='simone biles']

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round,medal
191,3.0,simone biles,NaN,6.2,7.400,0.0,13.600,2018,final,1
197,1.0,simone biles,NaN,6.4,8.666,0.0,15.066,2019,final,1

In [14]:
df20['medal'].value_counts()

medal
0    351
1      2
Name: count, dtype: int64

In [15]:
df24.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1334 entries, 205 to 1538
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     1334 non-null   float64
 1   Name     1334 non-null   object
 2   nation   1319 non-null   object
 3   D Score  1334 non-null   float64
 4   E Score  1334 non-null   float64
 5   Pen.     1334 non-null   float64
 6   Total    1334 non-null   float64
 7   year     1334 non-null   int64
 8   round    1334 non-null   object
dtypes: float64(5), int64(1), object(3)
memory usage: 104.2+ KB